---
kind: property
id: P:Autodesk.Revit.DB.FabricationPart.ProductName
source: html/94432b44-6d39-7bf7-da1a-ed81948bb350.htm
---
# Autodesk.Revit.DB.FabricationPart.ProductName Property

The product name of the fabrication part.

## Syntax (C#)
```csharp
public string ProductName { get; }
```